[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:19:9
                 return <Link to={url}>{row.username}</Link>;
             },
         },
-        {
-            Header: "Total Wealth",
-            id: "totalWealth",
-            accessor: (row, _rowIndex) => {
-                return row.totalWealth;
-            },
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
-            },
-        },
+        {},
         {
             Header: "Cows Owned",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:25:30
             accessor: (row, _rowIndex) => {
                 return row.totalWealth;
             },
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
