[Killed] BlockStatement
main/components/Commons/ManageCows.js:45:52
                             <Col className="text-center">
                                 <Button
                                     variant="outline-success"
-                                    onClick={() => {
-                                        setMessage("Buy");
-                                        openModal();
-                                    }}
+                                    onClick={() => {}}
                                     data-testid={"buy-cow-button"}
                                 >
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-sell-cow-modal"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] BlockStatement
main/components/Commons/ManageCows.js:57:52
                             <Col className="text-center">
                                 <Button
                                     variant="outline-danger"
-                                    onClick={() => {
-                                        setMessage("Sell");
-                                        openModal();
-                                    }}
+                                    onClick={() => {}}
                                     data-testid={"sell-cow-button"}
                                 >
killedBy: ManageCows tests calls setMessage with "Sell" when the Sell button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Sell"

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/ManageCows.js:58:52
                                 <Button
                                     variant="outline-danger"
                                     onClick={() => {
-                                        setMessage("Sell");
+                                        setMessage("");
                                         openModal();
                                     }}
killedBy: ManageCows tests calls setMessage with "Sell" when the Sell button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Sell"
Received: ""

Number of calls: 1
