[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:7:38
 import 'react-toastify/dist/ReactToastify.css';
 
 const ManageCowsModal = ({number, setNumber, isOpen, onClose, message, userCommons, onBuy, onSell }) => {
-    const handleInputChange = (e) => {
-        if(e.target.value < 0){
-          toast.warn(`Warning: You cannot ${message} a negative number of cows!`);
-        }
-        setNumber(e.target.value);
-    };
+    const handleInputChange = (e) => {};
 
     const handleSubmit = (e) => {
killedBy: ManageCowsModal toast warning for inputing negative number when buying cows
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "-3"

Number of calls: 0

[Killed] EqualityOperator
main/components/Commons/ManageCowsModal.js:8:12
 
 const ManageCowsModal = ({number, setNumber, isOpen, onClose, message, userCommons, onBuy, onSell }) => {
     const handleInputChange = (e) => {
-        if(e.target.value < 0){
+        if(e.target.value >= 0){
           toast.warn(`Warning: You cannot ${message} a negative number of cows!`);
         }
killedBy: ManageCowsModal toast warning for inputing negative number when buying cows
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Warning: You cannot Buy a negative number of cows!"

Number of calls: 0

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:14:33
         setNumber(e.target.value);
     };
 
-    const handleSubmit = (e) => {
-      e.preventDefault();
-      if(number < 0){
-        window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
-
-      } else {
-      if (message.includes('Buy')) {
-          onBuy(userCommons, number)
-      }
-      else {
-          onSell(userCommons, number)
-      }
-      setNumber(1);
-      onClose(); // Close the modal
-    }
-    };
+    const handleSubmit = (e) => {};
 
     const handleClose = () => {
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] EqualityOperator
main/components/Commons/ManageCowsModal.js:16:10
 
     const handleSubmit = (e) => {
       e.preventDefault();
-      if(number < 0){
+      if(number >= 0){
         window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
 
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"commonsId": 1, "cowDeaths": 5, "cowHealth": 98, "cowsBought": 5, "cowsSold": 5, "numOfCows": 5, "totalWealth": 1000, "userId": 1, "username": "George Washington"}, 5

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.js:17:22
     const handleSubmit = (e) => {
       e.preventDefault();
       if(number < 0){
-        window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
+        window.alert(``);
 
       } else {
killedBy: ManageCowsModal windows toolkit warning for buying negative cows
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "You cannot Buy a negative number of cows! Please enter a non-negative number."
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:19:14
       if(number < 0){
         window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
 
-      } else {
-      if (message.includes('Buy')) {
-          onBuy(userCommons, number)
-      }
-      else {
-          onSell(userCommons, number)
-      }
-      setNumber(1);
-      onClose(); // Close the modal
-    }
+      } else {}
     };
 
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"commonsId": 1, "cowDeaths": 5, "cowHealth": 98, "cowsBought": 5, "cowsSold": 5, "numOfCows": 5, "totalWealth": 1000, "userId": 1, "username": "George Washington"}, 5

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.js:20:11
         window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
 
       } else {
-      if (message.includes('Buy')) {
+      if (false) {
           onBuy(userCommons, number)
       }
killedBy: ManageCowsModal calls onBuy with correct arguments when buy button is clicked
statusReason: TypeError: onSell is not a function

[Killed] ConditionalExpression
main/components/Commons/ManageCowsModal.js:20:11
         window.alert(`You cannot ${message} a negative number of cows! Please enter a non-negative number.`);
 
       } else {
-      if (message.includes('Buy')) {
+      if (true) {
           onBuy(userCommons, number)
       }
killedBy: ManageCowsModal calls onSell with correct arguments when sell button is clicked
statusReason: TypeError: onBuy is not a function

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:23:12
       if (message.includes('Buy')) {
           onBuy(userCommons, number)
       }
-      else {
-          onSell(userCommons, number)
-      }
+      else {}
       setNumber(1);
       onClose(); // Close the modal
killedBy: ManageCowsModal calls onSell with correct arguments when sell button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"commonsId": 1, "cowDeaths": 5, "cowHealth": 98, "cowsBought": 5, "cowsSold": 5, "numOfCows": 5, "totalWealth": 1000, "userId": 1, "username": "George Washington"}, 3

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:31:31
     }
     };
 
-    const handleClose = () => {
-      setNumber(1);
-      onClose();
-    }
+    const handleClose = () => {}
 
     if (!isOpen) {
killedBy: ManageCowsModal calls onClose and setNumber when close button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/Commons/ManageCowsModal.js:36:18
       onClose();
     }
 
-    if (!isOpen) {
-        return null;
-    }
+    if (!isOpen) {}
 
   return (
killedBy: PlayPage tests click sell button
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.js:44:108
     <Modal data-testid={"buy-sell-cow-modal"} show={isOpen} onHide={handleClose}>
       <Modal.Body>
         <Form onSubmit={handleSubmit}>
-        <Form.Group data-testid={"buy-sell-cow-modal-closeGroup"} style={{display: 'flex', justifyContent: 'right'}}>
+        <Form.Group data-testid={"buy-sell-cow-modal-closeGroup"} style={{display: 'flex', justifyContent: ""}}>
                 <span aria-hidden="true">&times;</span>
killedBy: ManageCowsModal Check styling of modal components
statusReason: Error: expect(element).toHaveStyle()

- Expected

  display: flex;
- justify-content: right;

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.js:44:84
     <Modal data-testid={"buy-sell-cow-modal"} show={isOpen} onHide={handleClose}>
       <Modal.Body>
         <Form onSubmit={handleSubmit}>
-        <Form.Group data-testid={"buy-sell-cow-modal-closeGroup"} style={{display: 'flex', justifyContent: 'right'}}>
+        <Form.Group data-testid={"buy-sell-cow-modal-closeGroup"} style={{display: "", justifyContent: 'right'}}>
                 <span aria-hidden="true">&times;</span>
killedBy: ManageCowsModal Check styling of modal components
statusReason: Error: expect(element).toHaveStyle()

- Expected

- display: flex;
+ display: block;
  justify-content: right;

[Killed] StringLiteral
main/components/Commons/ManageCowsModal.js:63:34
           </Form.Group>
         </Form>
       </Modal.Body>
-      <Modal.Footer data-testid={"buy-sell-cow-modal-footer"} style={{borderTop: '0px'}}>
+      <Modal.Footer data-testid={""} style={{borderTop: '0px'}}>
         <Button data-testid={"buy-sell-cow-modal-cancel"} variant="secondary" onClick={handleClose}>Cancel</Button>
         <Button data-testid={"buy-sell-cow-modal-submit"} variant="primary" onClick={handleSubmit}>{message}</Button>
killedBy: ManageCowsModal Check styling of modal components
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-sell-cow-modal-footer"]

<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
  <div />
