[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.js:7:26
 
 function AnnouncementForm({ initialContents, submitAction, buttonLabel = "Create" }) {
     const navigate = useNavigate();
-    const testIdPrefix = "AnnouncementForm";
+    const testIdPrefix = "";
 
     // Initialize React Hook Form
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="AnnouncementForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.js:29:32
     const isodate_regex = /(\d{4}-[01]\d-[0-3]\d[T\s][0-2]\d:[0-5]\d)/i;
     // Stryker restore all
 
-    const onSubmit = (data) => {
-        const formattedData = {
-            ...data,
-            endDate: data.endDate ? new Date(data.endDate).toISOString() : null,
-        };
-        submitAction(formattedData);
-    };
+    const onSubmit = (data) => {};
 
     // Stryker disable all (String and object literals)
killedBy: AnnouncementForm tests that start date is set to current date when not provided, and end date is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

<html>
  <head />
  <body>
