[Killed] BooleanLiteral
main/components/Commons/CommonsOverview.js:13:61
     let navigate = useNavigate();
     // Stryker disable next-line all
     const [isTableVisible, setIsTableVisible] = React.useState(true);
-    const changeTableVisibility = () => { setIsTableVisible(!isTableVisible); };
+    const changeTableVisibility = () => { setIsTableVisible(isTableVisible); };
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commonsPlus.commons.id) };
     const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
killedBy: CommonsOverview tests for announcement table button
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show Announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >

[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:13:41
     let navigate = useNavigate();
     // Stryker disable next-line all
     const [isTableVisible, setIsTableVisible] = React.useState(true);
-    const changeTableVisibility = () => { setIsTableVisible(!isTableVisible); };
+    const changeTableVisibility = () => {};
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commonsPlus.commons.id) };
     const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
killedBy: CommonsOverview tests for announcement table button
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show Announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >

[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:14:42
     // Stryker disable next-line all
     const [isTableVisible, setIsTableVisible] = React.useState(true);
     const changeTableVisibility = () => { setIsTableVisible(!isTableVisible); };
-    const leaderboardButtonClick = () => { navigate("/leaderboard/" + commonsPlus.commons.id) };
+    const leaderboardButtonClick = () => {};
     const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
     return (
killedBy: CommonsOverview tests leaderboard button navigates to correct common's leaderboard
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/2"

Number of calls: 0

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:15:30
     const [isTableVisible, setIsTableVisible] = React.useState(true);
     const changeTableVisibility = () => { setIsTableVisible(!isTableVisible); };
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commonsPlus.commons.id) };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commonsPlus.commons.showLeaderboard );
+    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") && commonsPlus.commons.showLeaderboard );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.jpg);"
    >

[Killed] StringLiteral
main/components/Commons/CommonsOverview.js:35:47
                     </Col>
                     <Col>
                         <Button variant="outline-primary" onClick={changeTableVisibility} className="mt-3">
-                            {isTableVisible ? "Hide Announcements" : "Show Announcements"}
+                            {isTableVisible ? "" : "Show Announcements"}
                         </Button>
                     </Col>
killedBy: CommonsOverview tests for announcement table button
statusReason: TestingLibraryElementError: Unable to find an element with the text: Hide Announcements. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >

[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:39:18
                         </Button>
                     </Col>
                 </Row>
-                {isTableVisible && (
-                    <Row className="mt-3">
-                        <Col>
-                            <PagedAnnouncementTable />
-                        </Col>
-                    </Row>
-                )}
+                {isTableVisible || <Row className="mt-3">
+                        <Col>
+                            <PagedAnnouncementTable />
+                        </Col>
+                    </Row>}
             </Card.Body>
         </Card>
killedBy: CommonsOverview tests changing button for multiples times works correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedAnnouncementTable-header-startDate"]

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:39:18
                         </Button>
                     </Col>
                 </Row>
-                {isTableVisible && (
-                    <Row className="mt-3">
-                        <Col>
-                            <PagedAnnouncementTable />
-                        </Col>
-                    </Row>
-                )}
+                {false}
             </Card.Body>
         </Card>
killedBy: CommonsOverview tests changing button for multiples times works correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedAnnouncementTable-header-startDate"]

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >
