[Killed] ArrowFunction
main/components/Commons/PagedAnnouncementTable.js:38:23
             {
                 Header: "Start Date",
                 accessor: "startDate",
-                Cell: ({ value }) => timestampToDate(value),
+                Cell: () => undefined,
             },
             {
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
main/components/Commons/PagedAnnouncementTable.js:43:23
             {
                 Header: "End Date",
                 accessor: "endDate",
-                Cell: ({ value }) => (value ? timestampToDate(value) : ""),
+                Cell: () => undefined,
             },
             {
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Commons/PagedAnnouncementTable.js:43:72
             {
                 Header: "End Date",
                 accessor: "endDate",
-                Cell: ({ value }) => (value ? timestampToDate(value) : ""),
+                Cell: ({ value }) => (value ? timestampToDate(value) : "Stryker was here!"),
             },
             {
killedBy: PagedAnnouncementTable tests handles null end dates correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] ArrowFunction
main/components/Commons/PagedAnnouncementTable.js:53:9
 
 
     const sortees = React.useMemo(
-        () => [
-            {
-                id: "startDate",
-                desc: true
-            }
-        ],
+        () => undefined,
         // Stryker disable next-line all
         []
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Killed] StringLiteral
main/components/Commons/PagedAnnouncementTable.js:55:21
     const sortees = React.useMemo(
         () => [
             {
-                id: "startDate",
+                id: "",
                 desc: true
             }
killedBy: PagedAnnouncementTable tests sorts announcements by start date in descending order
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Current announcement"
Received string:    "2022-12-312026-12-31Newer announcement"

[Killed] BooleanLiteral
main/components/Commons/PagedAnnouncementTable.js:56:23
         () => [
             {
                 id: "startDate",
-                desc: true
+                desc: false
             }
         ],
killedBy: PagedAnnouncementTable tests sorts announcements by start date in descending order
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Current announcement"
Received string:    "2022-01-01Older announcement"

[Killed] BlockStatement
main/components/Commons/PagedAnnouncementTable.js:64:15
     );
 
     const legalDate = React.useMemo(
-        () => {
-            const now = new Date();
-            return page.content.filter((announcement) => {
-                const startDate = new Date(announcement.startDate);
-                const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
-                if (!endDate) {
-                    return startDate <= now;
-                } 
-                else {
-                    return (startDate <= now) && (now <= endDate);
-                }
-            });
-        },
+        () => {},
         // Stryker disable next-line all
         [page.content]
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] MethodExpression
main/components/Commons/PagedAnnouncementTable.js:66:20
     const legalDate = React.useMemo(
         () => {
             const now = new Date();
-            return page.content.filter((announcement) => {
-                const startDate = new Date(announcement.startDate);
-                const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
-                if (!endDate) {
-                    return startDate <= now;
-                } 
-                else {
-                    return (startDate <= now) && (now <= endDate);
-                }
-            });
+            return page.content;
         },
         // Stryker disable next-line all
killedBy: PagedAnnouncementTable tests filters future announcements correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="PagedAnnouncementTable-cell-row-1-col-announcementText" role="cell">Future announcement</td> instead

[Killed] BlockStatement
main/components/Commons/PagedAnnouncementTable.js:66:58
     const legalDate = React.useMemo(
         () => {
             const now = new Date();
-            return page.content.filter((announcement) => {
-                const startDate = new Date(announcement.startDate);
-                const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
-                if (!endDate) {
-                    return startDate <= now;
-                } 
-                else {
-                    return (startDate <= now) && (now <= endDate);
-                }
-            });
+            return page.content.filter((announcement) => {});
         },
         // Stryker disable next-line all
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: Error: Unable to find an element with the text: This is a test announcement for commons id 1. This one doesn't have an end date.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ConditionalExpression
main/components/Commons/PagedAnnouncementTable.js:69:21
             return page.content.filter((announcement) => {
                 const startDate = new Date(announcement.startDate);
                 const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
-                if (!endDate) {
+                if (true) {
                     return startDate <= now;
                 } 
killedBy: PagedAnnouncementTable tests for current date equal to start date or end date
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="PagedAnnouncementTable-cell-row-2-col-announcementText" role="cell">Past end date</td> instead

[Killed] ConditionalExpression
main/components/Commons/PagedAnnouncementTable.js:69:21
             return page.content.filter((announcement) => {
                 const startDate = new Date(announcement.startDate);
                 const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
-                if (!endDate) {
+                if (false) {
                     return startDate <= now;
                 } 
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: Error: Unable to find an element with the text: This is a test announcement for commons id 1. This one doesn't have an end date.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] EqualityOperator
main/components/Commons/PagedAnnouncementTable.js:70:28
                 const startDate = new Date(announcement.startDate);
                 const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
                 if (!endDate) {
-                    return startDate <= now;
+                    return startDate > now;
                 } 
                 else {
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: Error: Unable to find an element with the text: This is a test announcement for commons id 1. This one doesn't have an end date.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] EqualityOperator
main/components/Commons/PagedAnnouncementTable.js:70:28
                 const startDate = new Date(announcement.startDate);
                 const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
                 if (!endDate) {
-                    return startDate <= now;
+                    return startDate < now;
                 } 
                 else {
killedBy: PagedAnnouncementTable tests sorts announcements by start date in descending order
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Current announcement"
Received string:    "2022-12-312026-12-31Newer announcement"

[Killed] BlockStatement
main/components/Commons/PagedAnnouncementTable.js:72:22
                 if (!endDate) {
                     return startDate <= now;
                 } 
-                else {
-                    return (startDate <= now) && (now <= endDate);
-                }
+                else {}
             });
         },
killedBy: PagedAnnouncementTable tests sorts announcements by start date in descending order
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Newer announcement"
Received string:    "2022-01-01Older announcement"

[Killed] LogicalOperator
main/components/Commons/PagedAnnouncementTable.js:73:28
                     return startDate <= now;
                 } 
                 else {
-                    return (startDate <= now) && (now <= endDate);
+                    return startDate <= now || now <= endDate;
                 }
             });
killedBy: PagedAnnouncementTable tests for current date equal to start date or end date
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="PagedAnnouncementTable-cell-row-2-col-announcementText" role="cell">Future start date</td> instead

[Killed] ConditionalExpression
main/components/Commons/PagedAnnouncementTable.js:73:29
                     return startDate <= now;
                 } 
                 else {
-                    return (startDate <= now) && (now <= endDate);
+                    return (true) && (now <= endDate);
                 }
             });
killedBy: PagedAnnouncementTable tests for current date equal to start date or end date
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="PagedAnnouncementTable-cell-row-2-col-announcementText" role="cell">Future start date</td> instead
