[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.js:64:23
     const chatButtonStyle = {
         width: "40px",
         height: "40px",
-        borderRadius: "50%",
+        borderRadius: "",
         backgroundColor: "lightblue",
         color: "black",
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
- border-radius: 50%;
  bottom: 20px;
  color: black;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.js:67:19
         borderRadius: "50%",
         backgroundColor: "lightblue",
         color: "black",
-        position: "fixed",
+        position: "",
         bottom: "20px",
         right: "20px",
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 50%;
  bottom: 20px;
  color: black;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.js:69:16
         color: "black",
         position: "fixed",
         bottom: "20px",
-        right: "20px",
+        right: "",
     };
 
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: lightblue;
  border-radius: 50%;
  bottom: 20px;
  color: black;

[Killed] StringLiteral
src/main/pages/AdminViewPlayPage.js:106:50
                             <strong>{admin_name}</strong>
                             <br />
                             Visiting Farmer <strong>{visiting_user}</strong>'s
-                            Play Page for common{" "}
+                            Play Page for common{""}
                             <strong>{visiting_commons}</strong> in Read Only
                             Mode.
killedBy: AdminViewPlayPage tests displays read-only banner
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  This is a Admin Feature for Phillip ConradVisiting Farmer 's Play Page for common Sample Commons in Read Only Mode.
Received:
  This is a Admin Feature for Phillip ConradVisiting Farmer 's Play Page for commonSample Commons in Read Only Mode.

[Killed] BooleanLiteral
src/main/pages/AdminViewPlayPage.js:113:22
                     </Card.Body>
                 </Card>
                 <Container>
-                    {!!currentUser && <CommonsPlay currentUser={userCommons} />}
+                    {!currentUser && <CommonsPlay currentUser={userCommons} />}
                     {!!commonsPlus && (
                         <CommonsOverview
killedBy: AdminViewPlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsPlay"]

<body>
  <div>
    <div>
      <div
        class="d-flex flex-column min-vh-100"
      >

[Killed] ConditionalExpression
src/main/pages/AdminViewPlayPage.js:114:22
                 </Card>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={userCommons} />}
-                    {!!commonsPlus && (
-                        <CommonsOverview
-                            commonsPlus={commonsPlus}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && !!commonsPlus && (
killedBy: AdminViewPlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element by: [data-testid="CommonsOverview"]

<body>
  <div>
    <div>
      <div
        class="d-flex flex-column min-vh-100"
      >

[Killed] ConditionalExpression
src/main/pages/AdminViewPlayPage.js:121:22
                         />
                     )}
                     <br />
-                    {!!userCommons && !!commonsPlus && (
+                    {true && (
                         <CardGroup data-testid="adminviewplaypage-card-group">
                             <ManageCows
killedBy: AdminViewPlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/AdminViewPlayPage.js:140:18
                 style={chatContainerStyle}
                 data-testid="adminviewplaypage-chat-div"
             >
-                {!!isChatOpen && <ChatPanel commonsId={userId} />}
+                {true}
                 <Button
                     style={chatButtonStyle}
killedBy: AdminViewPlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body>
  <div>
    <div>
      <div
        class="d-flex flex-column min-vh-100"
      >

[Killed] BooleanLiteral
src/main/pages/AdminViewPlayPage.js:140:19
                 style={chatContainerStyle}
                 data-testid="adminviewplaypage-chat-div"
             >
-                {!!isChatOpen && <ChatPanel commonsId={userId} />}
+                {!isChatOpen && <ChatPanel commonsId={userId} />}
                 <Button
                     style={chatButtonStyle}
killedBy: AdminViewPlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BooleanLiteral
src/main/pages/AdminViewPlayPage.js:146:22
                     onClick={toggleChatWindow}
                     data-testid="adminviewplaypage-chat-toggle"
                 >
-                    {!!isChatOpen ? "▼" : "▲"}
+                    {!isChatOpen ? "▼" : "▲"}
                 </Button>
             </div>
killedBy: AdminViewPlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ▲
Received:
  ▼
