[Killed] StringLiteral
main/components/Commons/PagedAnnouncementTable.js:34:20
     );
     // Stryker restore  all
 
-    const testid = "PagedAnnouncementTable";
+    const testid = "";
 
     const columns = 
killedBy: CommonsOverview tests changing button for multiples times works correctly
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ArrayDeclaration
main/components/Commons/PagedAnnouncementTable.js:37:9
     const testid = "PagedAnnouncementTable";
 
     const columns = 
-        [
-            {
-                Header: "Start Date",
-                accessor: "startDate",
-                Cell: ({ value }) => timestampToDate(value),
-            },
-            {
-                Header: "End Date",
-                accessor: "endDate",
-                Cell: ({ value }) => (value ? timestampToDate(value) : ""),
-            },
-            {
-                Header: 'Important Announcements',
-                accessor: 'announcementText',
-            },
-        ];
+        [];
 
 
killedBy: CommonsOverview tests changing button for multiples times works correctly
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ObjectLiteral
main/components/Commons/PagedAnnouncementTable.js:38:13
 
     const columns = 
         [
-            {
-                Header: "Start Date",
-                accessor: "startDate",
-                Cell: ({ value }) => timestampToDate(value),
-            },
+            {},
             {
                 Header: "End Date",
killedBy: CommonsOverview tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/PagedAnnouncementTable.js:50:27
             },
             {
                 Header: 'Important Announcements',
-                accessor: 'announcementText',
+                accessor: "",
             },
         ];
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: Error: Unable to find an element with the text: This is a test announcement for commons id 1. This one doesn't have an end date.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ArrayDeclaration
main/components/Commons/PagedAnnouncementTable.js:56:15
 
 
     const sortees = React.useMemo(
-        () => [
-            {
-                id: "startDate",
-                desc: true
-            }
-        ],
+        () => [],
         // Stryker disable next-line all
         []
killedBy: PagedAnnouncementTable tests sorts announcements by start date in descending order
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Current announcement"
Received string:    "2022-01-01Older announcement"

[Killed] ObjectLiteral
main/components/Commons/PagedAnnouncementTable.js:57:13
 
     const sortees = React.useMemo(
         () => [
-            {
-                id: "startDate",
-                desc: true
-            }
+            {}
         ],
         // Stryker disable next-line all
killedBy: PagedAnnouncementTable tests sorts announcements by start date in descending order
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Current announcement"
Received string:    "2022-12-312026-12-31Newer announcement"

[Killed] BlockStatement
main/components/Commons/PagedAnnouncementTable.js:66:43
         []
     );
 
-    const legalDate = React.useMemo(() => {
-        const now = new Date();
-        return page.content.filter((announcement) => {
-            const startDate = new Date(announcement.startDate);
-            const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
-            if (!endDate) {
-                return startDate <= now;
-            } 
-            else {
-                return (startDate <= now) && (now <= endDate);
-            }
-        });
-    }, [page.content]);
+    const legalDate = React.useMemo(() => {}, [page.content]);
 
     return (
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
main/components/Commons/PagedAnnouncementTable.js:71:27
         return page.content.filter((announcement) => {
             const startDate = new Date(announcement.startDate);
             const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
-            if (!endDate) {
-                return startDate <= now;
-            } 
+            if (!endDate) {} 
             else {
                 return (startDate <= now) && (now <= endDate);
killedBy: PagedAnnouncementTable tests renders table with announcements correctly
statusReason: Error: Unable to find an element with the text: This is a test announcement for commons id 1. This one doesn't have an end date.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ConditionalExpression
main/components/Commons/PagedAnnouncementTable.js:72:24
             const startDate = new Date(announcement.startDate);
             const endDate = announcement.endDate ? new Date(announcement.endDate) : null;;
             if (!endDate) {
-                return startDate <= now;
+                return true;
             } 
             else {
killedBy: PagedAnnouncementTable tests filters future announcements correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="PagedAnnouncementTable-cell-row-1-col-announcementText" role="cell">Future announcement</td> instead

[Killed] ConditionalExpression
main/components/Commons/PagedAnnouncementTable.js:75:24
                 return startDate <= now;
             } 
             else {
-                return (startDate <= now) && (now <= endDate);
+                return true;
             }
         });
killedBy: PagedAnnouncementTable tests test for current date equal to start date or end date
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="PagedAnnouncementTable-cell-row-2-col-announcementText" role="cell">Future start date</td> instead

<html>
  <head />
  <body>
    <div>

[Killed] EqualityOperator
main/components/Commons/PagedAnnouncementTable.js:75:25
                 return startDate <= now;
             } 
             else {
-                return (startDate <= now) && (now <= endDate);
+                return (startDate < now) && (now <= endDate);
             }
         });
killedBy: PagedAnnouncementTable tests test for current date equal to start date or end date
statusReason: Error: Unable to find an element with the text: Exact start date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table
