[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.js:5:74
 import { useForm } from 'react-hook-form';
 import { useNavigate } from 'react-router-dom';
 
-function AnnouncementForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function AnnouncementForm({ initialContents, submitAction, buttonLabel = "" }) {
     const getCurrentDate = () => {
         const today = new Date();
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.js:6:34
 import { useNavigate } from 'react-router-dom';
 
 function AnnouncementForm({ initialContents, submitAction, buttonLabel = "Create" }) {
-    const getCurrentDate = () => {
-        const today = new Date();
-        const year = today.getUTCFullYear();
-        const month = String(today.getUTCMonth() + 1).padStart(2, '0');
-        const day = String(today.getUTCDate()).padStart(2, '0');
-        return `${year}-${month}-${day}`;
-    };
+    const getCurrentDate = () => {};
 
     // Stryker disable all
killedBy: AnnouncementForm tests should populate startDate with the mocked current date on create announcement page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2023-01-05"
Received: ""

<html>
  <head />
  <body>

[Killed] ArithmeticOperator
main/components/Announcement/AnnouncementForm.js:9:30
     const getCurrentDate = () => {
         const today = new Date();
         const year = today.getUTCFullYear();
-        const month = String(today.getUTCMonth() + 1).padStart(2, '0');
+        const month = String(today.getUTCMonth() - 1).padStart(2, '0');
         const day = String(today.getUTCDate()).padStart(2, '0');
         return `${year}-${month}-${day}`;
killedBy: AnnouncementForm tests should populate startDate with the mocked current date on create announcement page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2023-01-05"
Received: ""

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.js:9:67
     const getCurrentDate = () => {
         const today = new Date();
         const year = today.getUTCFullYear();
-        const month = String(today.getUTCMonth() + 1).padStart(2, '0');
+        const month = String(today.getUTCMonth() + 1).padStart(2, "");
         const day = String(today.getUTCDate()).padStart(2, '0');
         return `${year}-${month}-${day}`;
killedBy: AnnouncementForm tests should populate startDate with the mocked current date on create announcement page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2023-01-05"
Received: ""

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Announcement/AnnouncementForm.js:35:32
 
     const testIdPrefix = "AnnouncementForm";
 
-    const onSubmit = (data) => {
-        if (!data.endDate) {
-            data.endDate = null;
-        }
-
-        const startDate = new Date(data.startDate).toISOString().split('T')[0];  
-        data.startDate = startDate;
-
-        if (data.endDate) {
-            const endDate = new Date(data.endDate).toISOString().split('T')[0];
-            data.endDate = endDate;
-        }
-        
-        submitAction(data);
-    };
+    const onSubmit = (data) => {};
 
     return (
killedBy: AnnouncementForm tests onSubmit sets endDate to null if it's blank
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"announcementText": "Test announcement", "endDate": null, "startDate": "2023-11-21"}

Number of calls: 0

<html>
  <head />

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementForm.js:36:13
     const testIdPrefix = "AnnouncementForm";
 
     const onSubmit = (data) => {
-        if (!data.endDate) {
+        if (data.endDate) {
             data.endDate = null;
         }
killedBy: AnnouncementForm tests onSubmit sets endDate to null if it's blank
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "announcementText": "Test announcement",
-   "endDate": null,

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:36:13
     const testIdPrefix = "AnnouncementForm";
 
     const onSubmit = (data) => {
-        if (!data.endDate) {
+        if (false) {
             data.endDate = null;
         }
killedBy: AnnouncementForm tests onSubmit sets endDate to null if it's blank
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "announcementText": "Test announcement",
-   "endDate": null,

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.js:44:72
         data.startDate = startDate;
 
         if (data.endDate) {
-            const endDate = new Date(data.endDate).toISOString().split('T')[0];
+            const endDate = new Date(data.endDate).toISOString().split("")[0];
             data.endDate = endDate;
         }
killedBy: AnnouncementForm tests onSubmit sends valid data when endDate is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "announcementText": "Test announcement",
-   "endDate": "2024-11-21",

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.js:80:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.startDate && 'Start Date is required.'}
+                    {errors.startDate || 'Start Date is required.'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: AnnouncementForm tests Start Date is required and shows an error message if left blank
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.js:103:34
                     id="announcementText"
                     rows={5}
                     isInvalid={Boolean(errors.announcementText)}
-                    {...register("announcementText", {
+                    {...register("", {
                         required: "Announcement is required."
                     })}
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementForm.js:103:54
                     id="announcementText"
                     rows={5}
                     isInvalid={Boolean(errors.announcementText)}
-                    {...register("announcementText", {
-                        required: "Announcement is required."
-                    })}
+                    {...register("announcementText", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: AnnouncementForm tests onSubmit sets endDate to null if it's blank
statusReason: TypeError: submitAction is not a function

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.js:104:35
                     rows={5}
                     isInvalid={Boolean(errors.announcementText)}
                     {...register("announcementText", {
-                        required: "Announcement is required."
+                        required: ""
                     })}
                 />
killedBy: AnnouncementForm tests onSubmit sets endDate to null if it's blank
statusReason: TypeError: submitAction is not a function
