[Killed] ArrowFunction
src/main/pages/AdminCreateAnnouncementsPage.js:10:33
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 
 const AdminCreateAnnouncementsPage = () => {
-    const objectToAxiosParams = (newAnnouncement) => ({
-        url:`/api/announcements/post/${commonsId}`,
-        method: "POST",
-        params: {
-            announcementText: newAnnouncement.announcementText,
-            startDate: newAnnouncement.startDate,
-            endDate: newAnnouncement.endDate,
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const { commonsId } = useParams(); 
killedBy: AdminCreateAnnouncementsPage tests ensures correct API call is made with all parameters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminCreateAnnouncementsPage.js:10:55
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 
 const AdminCreateAnnouncementsPage = () => {
-    const objectToAxiosParams = (newAnnouncement) => ({
-        url:`/api/announcements/post/${commonsId}`,
-        method: "POST",
-        params: {
-            announcementText: newAnnouncement.announcementText,
-            startDate: newAnnouncement.startDate,
-            endDate: newAnnouncement.endDate,
-        }
-    });
+    const objectToAxiosParams = (newAnnouncement) => ({});
 
     const { commonsId } = useParams(); 
killedBy: AdminCreateAnnouncementsPage tests ensures correct API call is made with all parameters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminCreateAnnouncementsPage.js:37:41
 
     const commonsName = commonsPlus?.commons.name;
 
-    const onSuccess = (announcement) => {
-        toast(
-          <div>
-            <p>Announcement successfully created!</p>
-            <ul>
-              <li>{`ID: ${announcement.id}`}</li>
-              <li>{`Start Date: ${announcement.startDate}`}</li>
-              <li>{`End Date: ${announcement.endDate}`}</li>
-              <li>{`Announcement: ${announcement.announcementText}`}</li>
-            </ul>
-          </div>
-        );
-      };
+    const onSuccess = (announcement) => {};
 
     // Stryker disable all (Copied from frontend/src/main/pages/AdminCreateCommonsPage.js)
killedBy: AdminCreateAnnouncementsPage tests ensures success toast displays correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: <div><p>Announcement successfully created!</p><ul><li>ID: 42</li><li>Start Date: 2023-11-21</li><li>End Date: 2024-11-21</li><li>Announcement: Test announcement</li></ul></div>

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.js:43:20
             <p>Announcement successfully created!</p>
             <ul>
               <li>{`ID: ${announcement.id}`}</li>
-              <li>{`Start Date: ${announcement.startDate}`}</li>
+              <li>{``}</li>
               <li>{`End Date: ${announcement.endDate}`}</li>
               <li>{`Announcement: ${announcement.announcementText}`}</li>
killedBy: AdminCreateAnnouncementsPage tests ensures success toast displays correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,11 +5,11 @@
    <ul>
      <li>
