[Killed] ArrowFunction
src/main/pages/AdminCreateAnnouncementsPage.js:11:33
 
 const AdminCreateAnnouncementsPage = () => {
 
-    const objectToAxiosParams = (newAnnouncement) => ({
-        url:`/api/announcements/post/${commonsId}`,
-        method: "POST",
-        params: {
-            announcementText: newAnnouncement.announcementText,
-            startDate: newAnnouncement.startDate,
-            endDate: newAnnouncement.endDate,
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const { commonsId } = useParams(); 
killedBy: AdminCreateAnnouncementsPage tests When you fill in form and click submit, the right things happen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Survived] StringLiteral
src/main/pages/AdminCreateAnnouncementsPage.js:43:20
           <div>
             <p>Announcement successfully created!</p>
             <ul>
-              <li>{`ID: ${announcement.id}`}</li>
+              <li>{``}</li>
               <li>{`Start Date: ${announcement.startDate}`}</li>
               <li>{`End Date: ${announcement.endDate}`}</li>
