[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:16:24
         handleSubmit,
     } = useForm({
         defaultValues: {
-            startDate: initialContents?.startDate || new Date().toISOString(),
+            startDate: true,
             endDate: initialContents?.endDate || "",
             announcementText: initialContents?.announcementText || "",
killedBy: AnnouncementForm tests that start date is set to current date when not provided, and end date is null
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 100000
Received:   1732351271188

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:16:24
         handleSubmit,
     } = useForm({
         defaultValues: {
-            startDate: initialContents?.startDate || new Date().toISOString(),
+            startDate: false,
             endDate: initialContents?.endDate || "",
             announcementText: initialContents?.announcementText || "",
killedBy: AnnouncementForm tests that start date is set to current date when not provided, and end date is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:17:22
     } = useForm({
         defaultValues: {
             startDate: initialContents?.startDate || new Date().toISOString(),
-            endDate: initialContents?.endDate || "",
+            endDate: true,
             announcementText: initialContents?.announcementText || "",
         },
killedBy: AnnouncementForm tests that start date is set to current date when not provided, and end date is null
statusReason: Error: expect(received).toBeNull()

Received: "1970-01-01T00:00:00.001Z"

<html>
  <head />
  <body>
    <div>

[Killed] OptionalChaining
main/components/Announcement/AnnouncementForm.js:17:22
     } = useForm({
         defaultValues: {
             startDate: initialContents?.startDate || new Date().toISOString(),
-            endDate: initialContents?.endDate || "",
+            endDate: initialContents.endDate || "",
             announcementText: initialContents?.announcementText || "",
         },
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'endDate')

[Killed] OptionalChaining
main/components/Announcement/AnnouncementForm.js:18:31
         defaultValues: {
             startDate: initialContents?.startDate || new Date().toISOString(),
             endDate: initialContents?.endDate || "",
-            announcementText: initialContents?.announcementText || "",
+            announcementText: initialContents.announcementText || "",
         },
     });
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'announcementText')

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.js:18:31
         defaultValues: {
             startDate: initialContents?.startDate || new Date().toISOString(),
             endDate: initialContents?.endDate || "",
-            announcementText: initialContents?.announcementText || "",
+            announcementText: initialContents?.announcementText && "",
         },
     });
killedBy: AnnouncementForm tests that start date is set to current date when not provided, and end date is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:35:14
 
     return (
         <Form onSubmit={handleSubmit(onSubmit)}>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={`${testIdPrefix}-id`}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3">
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="AnnouncementForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Announcement/AnnouncementForm.js:35:14
 
     return (
         <Form onSubmit={handleSubmit(onSubmit)}>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={`${testIdPrefix}-id`}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">Id</Form.Label>
+                    <Form.Control data-testid={`${testIdPrefix}-id`} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3">
killedBy: AnnouncementForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ObjectLiteral
main/components/Announcement/AnnouncementForm.js:56:47
                     id="startDate"
                     type="text" 
                     isInvalid={Boolean(errors.startDate)}
-                    {...register("startDate", {
-                        required: "Start Date is required.",
-                        pattern: {
-                            value: isodate_regex,
-                            message: "Start Date must be in ISO format.",
-                        },
-                    })}
+                    {...register("startDate", {})}
                     placeholder="Enter date in ISO format (e.g., 2023-11-21T17:52:33)"
                 />

[Survived] ObjectLiteral
main/components/Announcement/AnnouncementForm.js:78:34
                     type="text" 
                     isInvalid={Boolean(errors.endDate)}
                     {...register("endDate", {
-                        pattern: {
-                            value: isodate_regex,
-                            message: "End Date must be in ISO format.",
-                        },
+                        pattern: {},
                     })}
                     placeholder="Enter date in ISO format (e.g., 2024-11-21T17:52:33)"

[Survived] StringLiteral
main/components/Announcement/AnnouncementForm.js:94:34
                 <Form.Label htmlFor="announcementText">Announcement</Form.Label>
                 <Form.Control
                     as="textarea"
-                    data-testid={`${testIdPrefix}-announcementText`}
+                    data-testid={``}
                     id="announcementText"
                     rows={5}

[Killed] OptionalChaining
main/components/Announcement/AnnouncementForm.js:101:35
                     {...register("announcementText", {
                         required: "Announcement is required.",
                     })}
-                    defaultValue={initialContents?.announcementText || ""}
+                    defaultValue={initialContents.announcementText || ""}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: AdminCreateAnnouncementsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'announcementText')

[Survived] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:101:35
                     {...register("announcementText", {
                         required: "Announcement is required.",
                     })}
-                    defaultValue={initialContents?.announcementText || ""}
+                    defaultValue={true}
                 />
                 <Form.Control.Feedback type="invalid">

[Killed] StringLiteral
main/components/Announcement/AnnouncementForm.js:117:30
             <Button
                 variant="Secondary"
                 onClick={() => navigate(-1)}
-                data-testid={`${testIdPrefix}-cancel`}
+                data-testid={``}
             >
                 Cancel
killedBy: AnnouncementForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Error: Unable to find an element by: [data-testid="AnnouncementForm-cancel"]

<body>
  <div>
    <form
      class=""
    >
      <div
