[Killed] ConditionalExpression
main/components/Announcement/AnnouncementForm.js:39:14
 
     return (
         <Form onSubmit={handleSubmit(onSubmit)}>
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={`${testIdPrefix}-id`}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3">
killedBy: AnnouncementForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="AnnouncementForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] ObjectLiteral
main/components/Announcement/AnnouncementForm.js:62:34
                     isInvalid={Boolean(errors.startDate)}
                     {...register("startDate", {
                         required: "Start Date is required.",
-                        pattern: {
-                            value: isodate_regex,
-                            message: "Start Date must be in ISO format.",
-                        },
+                        pattern: {},
                     })}
                     placeholder="Enter date in ISO format (e.g., 2023-11-21T17:52:33)"

[Survived] ObjectLiteral
main/components/Announcement/AnnouncementForm.js:81:45
                     id="endDate"
                     type="text" 
                     isInvalid={Boolean(errors.endDate)}
-                    {...register("endDate", {
-                        pattern: {
-                            value: isodate_regex,
-                            message: "End Date must be in ISO format.",
-                        },
-                    })}
+                    {...register("endDate", {})}
                     placeholder="Enter date in ISO format (e.g., 2024-11-21T17:52:33)"
                 />
